import { Ingredient } from '../ingredient.model';

export const ingredients: Ingredient[] = [
    new Ingredient('Water (aqua)', 'Water', 'Растворитель', 'Основной компонент практически всей косметики (исключения безводная косметика). Обеспечивает необходимую структуру. В косметике используется в основном деминерализованная вода прощедшая очистку методом обратного осмоса. Так же к воде применяются жесткие требования по микробиологической чистоте., Основной ингредиент - вода', 1),
    new Ingredient('Stearic acid', 'Stearic acid', 'Загуститель', '',2),
    new Ingredient('Glycerin', 'Glycerin', 'Кондиционер, Увлажнение, Контроль вязкости, Растворитель', 'хороший растворитель для лучшего растворения различных компонентов в смеси. Смягчает агреесивное воздействие ПАВ. Способствует лучшему проникновению влаги в кожу.',3),
    new Ingredient('Cocos nucifera (coconut) oil', 'Cocos nucifera (coconut) oil', 'Растворитель, Кондиционирование кожи, маскировка, смягчающее, Fragrance, Кондиционер для волос', '',4),
    new Ingredient('Sorbitol', 'Sorbitol', 'Смягчающий эффект', '',5),
    new Ingredient('Lanolin', 'Lanolin', 'Загуститель', '',6),
    new Ingredient('Сitric acid (citric acid)', 'Сitric acid (citric acid)', 'Хелатирование, Ароматизатор, Регулятор рН, Загуститель', 'Белое кристалличе-, ское вещество без запаха с приятным вкусом. Растворяется в воде и этаноле. Ши-, роко распространена в природе, получают из природных растительных источников, (лимон, брусника и др.) либо ферментацией из сахара. Используется в косметиче-, ских препаратах как консервант, разбавитель, модификатор рН, пеногаситель, хе-, латирующий агент. Оказывает на кожу вяжущее, очищающее и отбеливающее дей-, ствие. Вводится в состав очищающих кремов, депиляториев, ополаскивателей для, волос, красок для волос, кремов от веснушек. Иногда используется как регулятор рН, косметических изделий., Антиоксидант',7)
]